c5/src/Documents/Roles/Roles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Roles</name>
  <posting>Deny</posting>
  <attributes>
    <name>Action</name>
    <type>
      <types>EnumRef.AssignRoles</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Role</name>
    <type>
      <types>EnumRef.Roles</types>
    </type>
  </attributes>
  <attributes>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
</mdclass:Document>

c5/src/Enums/AssignRoles/AssignRoles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AssignRoles</name>
  <enumValues>
    <name>Assign</name>
  </enumValues>
  <enumValues>
    <name>Cancel</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/Roles/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Constraints.ShowAccess ( ThisObject );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		DocumentForm.Init ( Object );
		fillNew ();
		Constraints.ShowAccess ( ThisObject );
	endif; 
	readAppearance ();
	Appearance.Apply ( ThisObject );
		
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Department enable Object.Role = Enum.Roles.DepartmentHead and empty ( Object.Ссылка );
	|Information Create show filled ( Object.Ссылка );
	|Apply show empty ( Object.Ссылка );
	|Company Action User Role Memo enable empty ( Object.Ссылка )
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( not Parameters.CopyingValue.IsEmpty () ) then
		return;
	endif; 
	settings = Logins.Settings ( "Company" );
	Object.Company = settings.Company;
	
EndProcedure 

&AtServer
Procedure OnWriteAtServer ( Cancel, CurrentObject, WritingParameters )
	
	applyChanges ();
	
EndProcedure

&AtServer
Procedure applyChanges ()
	
	SetPrivilegedMode ( true );
	r = InformationRegisters.BPRouter.CreateRecordManager ();
	r.User = Object.User;
	r.Role = Object.Role;
	r.Department = Object.Department;
	r.Activity = true;
	if ( Object.Action = Enums.AssignRoles.Assign ) then
		r.Write ();
	else
		r.Delete ();
	endif; 
	SetPrivilegedMode ( false );
	
EndProcedure 

&AtClient
Procedure AfterWrite ( WritingParameters )
	
	NotifyChanged ( Type ( "InformationRegisterRecordKey.BPRouter" ) );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure Create ( Command )
	
	callback = new NotifyDescription ( "CloseForm", ThisObject );
	OpenForm ( "Document.Roles.ObjectForm", new Structure ( "CopyingValue", Object.Ref ), , , , , callback );
	
EndProcedure

&AtClient
Procedure CloseForm ( Result, Params ) export
	
	Close ();
	
EndProcedure 

&AtClient
Procedure RoleOnChange ( Item )
	
	applyRole ();
	
EndProcedure

&AtServer
Procedure applyRole ()
	
	if ( Object.Role <> Enums.Roles.DepartmentHead ) then
		Object.Department = undefined;
	endif; 
	Appearance.Apply ( ThisObject, "Object.Role" );
	
EndProcedure
